{"id": "gsm8k_train_03332", "response": "Let's say Jason steps on his partner's feet x times.\nNancy steps on her partner's feet 3 times as often, so Nancy steps on her partner's feet 3x times.\nTogether they step on each other's feet 32 times, so we can make the equation:\nx + 3x = 32\nCombine like terms: 4x = 32\nDivide by 4: x = 8\nSo Jason steps on his partner's feet 8 times.\nTherefore, the answer (arabic numerals) is 8.", "y_correct": true, "question": "Nancy and Jason are learning to dance for the first time. Nancy steps on her partner's feet 3 times as often as Jason. If together they step on each other's feet 32 times, how many times does Jason step on his partner's feet?"}
{"id": "gsm8k_train_05322", "response": "Sam has 7 fish.\nJoe has 8 times as many fish as Sam, so Joe has 7 * 8 = 56 fish.\nHarry has 4 times as many fish as Joe, so Harry has 56 * 4 = 224 fish.\nTherefore, the answer (arabic numerals) is 224.", "y_correct": true, "question": "Of the 3 friends, Harry has 4 times as many fish as Joe, and Joe has 8 times as many fish as Sam does. If Sam has 7 fish, how many fish does Harry have?"}
{"id": "gsm8k_train_05521", "response": "To find the total time it takes to make the bread, we need to convert everything to the same units. \n\n1 hour to come to room temperature = 1 hour.\n15 minutes to shape the dough = 0.25 hours (since 15 minutes is 15/60 = 0.25 hours)\n2 hours to proof = 2 hours\n30 minutes to bake = 0.5 hours\n15 minutes to cool = 0.25 hours\n\nAdding all these times together: 1 + 0.25 + 2 + 0.5 + 0.25 = 4 hours\n\nSince the bakery opens at 6:00 am, the head baker needs to start working at least 4 hours before that. \n6:00 am - 4 hours = 2:00 am.\n\nTherefore, the head baker needs to arrive at the store by 2:00 am to start working.", "y_correct": false, "question": "It takes 1 hour for refrigerated dough to come to room temperature.  It takes 15 minutes to shape the dough and 2 hours to proof.  The bread takes 30 minutes to bake and 15 minutes to cool.  If the bakery opens at 6:00 am, what is the latest time the head baker can make it to the store to start working?"}
{"id": "gsm8k_train_00063", "response": "Shawna's goal is 30 situps per day. \nOn Monday, she did 12, so she was short 30 - 12 = 18 situps.\nOn Tuesday, she made up for 19 situps. \nSo now she is 18 - 19 = -1 short.\nTo meet her goal and make up for the ones she didn't do, she would have to do 1 more situp on Wednesday.\nTherefore, the answer (arabic numerals) is 1.", "y_correct": false, "question": "Shawna's workout goal is 30 situps. On Monday, Shawna was only able to do 12 situps, so she decided that she would make up for the rest on Tuesday. However, she was only able to do 19 situps on Tuesday. How many situps would Shawna have to do on Wednesday to meet her minimum goal and make up for the ones she didn't do?"}
{"id": "gsm8k_train_00310", "response": "First, let's calculate the total hours worked by each group per month.\nThere are 25 days in the month, and 8 hours per day, so that is 25 * 8 = 200 hours.\n\nThe warehouse workers make $15/hour and there are 4 of them. Their total hours worked is 200 hours, and their total salary is 200 * 15 = 3000 dollars.\nThe managers make $20/hour and there are 2 of them. Their total hours worked is 200 hours, and their total salary is 200 * 20 = 4000 dollars.\n\nThe total salary for all employees is 3000 + 4000 = 7000 dollars.\n\nTo calculate the FICA taxes, Janet has to pay 10% of the total salary. 10% of 7000 is 0.10 * 7000 = 700 dollars.\n\nTherefore, the total amount Janet owes for wages and taxes is 7000 (salaries) + 700 (taxes) = 6700 dollars.", "y_correct": false, "question": "Janet hires six employees. Four of them are warehouse workers who make $15/hour, and the other two are managers who make $20/hour. Janet has to pay 10% of her workers' salaries in FICA taxes. If everyone works 25 days a month and 8 hours a day, how much does Janet owe total for their wages and taxes for one month?"}
{"id": "gsm8k_train_02871", "response": "Gloria needs 129,000 dollars for the cabin, but she only has 150 dollars.\nSo she needs 129,000 - 150 = 128,850 dollars.\nShe will get 100 dollars for each of the 20 cypress trees, which is 20 x 100 = 2,000 dollars.\nShe will get 300 dollars for each of the 24 maple trees, which is 24 x 300 = 7,200 dollars.\nShe will get 200 dollars for each of the 600 pine trees, which is 600 x 200 = 120,000 dollars.\nIn total, she will get 2,000 + 7,200 + 120,000 = 129,200 dollars from selling the trees.\nAfter selling the trees, she will have 129,200 dollars.\nShe will pay 129,000 dollars for the cabin, so she will have 129,200 - 129,000 = 200 dollars left.\nTherefore, the answer (arabic numerals) is 200.", "y_correct": false, "question": "Gloria wants to buy the $129,000 mountain cabin that her friend Alfonso is selling. She only has $150 in cash. She intends to raise the remaining amount by selling her mature trees for lumber. She has 20 cypress trees, 600 pine trees, and 24 maple trees. She will get $100 for each cypress tree, $300 for a maple tree, and $200 per pine tree. After paying Alfonso for the cabin, how much money will Gloria have left?"}
